diroik/STM32WS/MKAB_BOOT_STM32F100/libs/src/Classes.cpp
//=============================================================================
#include <Classes.h>
#include <flash_map.h>
#include <type_define.h>
#include <stm32f10x_flash.h>
//=================================================
 
//=============================================================================
//*****************************************************************************
//*** Class TObject
//*****************************************************************************
//=============================================================================
//  
//=======================================


  //typedef  void (*pFunction)(void);
  //pFunction Jump_To_Application;


void  TObject::SetDataTime(TDateTime &dt, string &date, string &time)
{
  //static bool flg = false;
  CLEAR_WDT;
  vector<string> tmpvect;   
  TRtcTime DateTime;
  TBuffer::Split(date,".",tmpvect);
  if(tmpvect.size() != 3){ return;}
  DateTime.Day    = atoi(tmpvect[0].c_str());
  DateTime.Month  = atoi(tmpvect[1].c_str());
  DateTime.Year   = atoi(tmpvect[2].c_str());
  tmpvect.clear(); 
  TBuffer::Split(time,":",tmpvect);
  if(tmpvect.size() != 3){ return;}
  DateTime.Hour     = atoi(tmpvect[0].c_str());
  DateTime.Minute   = atoi(tmpvect[1].c_str());
  DateTime.Second   = atoi(tmpvect[2].c_str());  
  
  long CurrGloalSeconds   = dt.DateTime.Hour*3600L + dt.DateTime.Minute*60L + dt.DateTime.Second*1L;
  long NewGlobalSeconds   = DateTime.Hour*3600L + DateTime.Minute*60L + DateTime.Second*1L;
  
  long div = labs(NewGlobalSeconds - CurrGloalSeconds);
  if( div > 2)//если разница большая - прямая запись значений времени
  {
    dt.SetTime(DateTime);//установка нового времени
  }

}
//=============================================================================
// Запись в память констант  
//=======================================
bool TObject::Save_ParamsInInfo(Data_Params  *Params)
{
//Перезапись всей страницы с временным(защитным) хранилищем в другой странице 
 Word         Len;
 Byte        *Tmp                  = (Byte *)Params;  //взяли указатель 
  
  Len = sizeof(*Params); 
  for(Word i=0; i<3; i++)
  {
    WriteBufToPage((Byte const*)&TMP_PARAMS, Tmp, Len-1 );  //записали во временную(защитную) память
    WriteBufToPage((Byte const*)&PARAMS    , Tmp, Len-1 );  //записали куда надо
  
    if(VerifyMemory((Byte const*)&PARAMS,Tmp, Len-1))
    {//удалили временную запись 
      ClrFlashSegment( (Byte const*)&TMP_PARAMS );
      return true; 
    }
    else
    { continue;}
  }
  return false;
}
//=============================================================================
// Запись в память констант  
//=======================================
bool TObject::Save_ParamsInInfoA(Boot_Params  *BootParams)
{
//Перезапись всей страницы с временным(защитным) хранилищем в другой странице 
 Word         Len;
 Byte        *Tmp                  = (Byte *)BootParams;  //взяли указатель 
  
  Len = sizeof(*BootParams); 
  for(Word i=0; i<3; i++)
  {
    WriteBufToPage((Byte const*)&TMP_BOOT_PARAMS, Tmp, Len-1 );  //записали во временную(защитную) память
    WriteBufToPage((Byte const*)&BOOT_PARAMS    , Tmp, Len-1 );  //записали куда надо
  
    if(VerifyMemory((Byte const*)&BOOT_PARAMS,Tmp, Len-1))
    {//удалили временную запись 
      ClrFlashSegment( (Byte const*)&TMP_BOOT_PARAMS );
      return true; 
    }
    else
    { continue;}
  }
  return false;
}
//=============================================================================
//  
//=======================================
bool TObject::VerifyMemory(Byte const* DestAddr, Byte* ScrAddr,Word Len)
{
  for(Word i=0; i<Len; i++)
  {
    CLEAR_WDT;
    if(DestAddr[i]!=ScrAddr[i])
    { return false;}
  }
  return true; 
}
//=============================================================================
//  
//=======================================
bool TObject::RestoreMemParams(void)
{
 Word         Len;
 Data_Params  TmpParam            = *PtrToConstants;    //сохранили текущие значения параметров в оперативке
 Byte        *Tmp                 = (Byte *)&TmpParam;  //взяли указатель 
  
  Len = sizeof(TmpParam);
  
  for(Word i = 0;i<3;i++)
  {
    CLEAR_WDT;
    WriteBufToPage((Byte const*)&PARAMS    , Tmp, Len-1 );  //записали куда надо
    if(VerifyMemory((Byte const*)&PARAMS,Tmp, Len))
    {//удалили временную запись 
      ClrFlashSegment( (Byte const*)&TMP_PARAMS );
      return true; 
    }
    else
    { continue;}
  }
  return false;  
}
//=============================================================================
//  
//=======================================
bool TObject::RestoreBootParams(void)
{
 Word         Len;
 Boot_Params  TmpParam            = *PtrToBootConstants;    //сохранили текущие значения параметров в оперативке
 Byte        *Tmp                 = (Byte *)&TmpParam;  //взяли указатель 
  
  Len = sizeof(TmpParam);
  
  for(Word i = 0; i < 3; i++)
  {
    CLEAR_WDT;
    WriteBufToPage((Byte const*)&BOOT_PARAMS    , Tmp, Len-1 );  //записали куда надо
    if(VerifyMemory((Byte const*)&BOOT_PARAMS,  Tmp, Len))
    {//удалили временную запись 
      ClrFlashSegment( (Byte const*)&TMP_BOOT_PARAMS );
      return true; 
    }
    else
    { continue;}
  }
  return false;  
}
//=============================================================================
//  
//=======================================
void TObject::RestoreDefault(void)
{
  Word         Len;
  Data_Params  TmpParam;
  Byte        *Tmp             = (Byte *)&TmpParam;  //взяли указатель 
  Byte        Addr[]           = "11";
  Byte        PassWord[]       = "TM_DP485";
  Byte        Unit_Type[]      = "MKAB-MTS";
  Word        i;
 
  CLEAR_WDT;
  for(i=0;i<sizeof(Addr);i++)       { TmpParam.DevAddress[i]=Addr[i];} 
  for(i=0;i<sizeof(PassWord);i++)   { TmpParam.PassWord[i]=PassWord[i];}               
  for(i=0;i<sizeof(Unit_Type);i++)  { TmpParam.Unit_Type[i]=Unit_Type[i];}  

  TmpParam.MAIN_BOUD_RATE     = 38400;
  TmpParam.MAIN_timeout       = 500;
  
  
  Len = sizeof(TmpParam);
  WriteBufToPage((Byte const*)&PARAMS    , Tmp, Len-1 );  //записали куда надо
}
//=============================================================================
//  
//=======================================
void TObject::RestoreBootDefault(void)
{
 Word         Len;
 Boot_Params  TmpBootParam;
 Byte        *Tmp;
 
        CLEAR_WDT;
        Tmp         = (Byte *)&TmpBootParam;  //взяли указатель 
        TmpBootParam.BootStatus           = 0x00;
        TmpBootParam.CurVersion           = BOOTLOADER_CURR_VER;
        TmpBootParam.AppAdrStart          = 0x5C00;
        TmpBootParam.AppCurrAdr           = 0x5C00;
          

        TmpBootParam.Segment_Count          = 0x00;
        TmpBootParam.AppCRC                 = 0xFFFF;
        
        TmpBootParam.WriteRamVectorsFlag    = 0xFF;
        TmpBootParam.UsartIntVector         = 0xFFFF;
        TmpBootParam.Timer0B1IntVector      = 0xFFFF;
        TmpBootParam.Timer1A1IntVector      = 0xFFFF;
        TmpBootParam.UnmIntVector           = 0xFFFF;
        TmpBootParam.KeyByte                = 0xAA;
        
        Len = sizeof(TmpBootParam);
        WriteBufToPage((Byte const*)&BOOT_PARAMS    , Tmp, Len-1 );  //записали куда надо
}
//=============================================================================
//  
//=======================================
void TObject::WriteBufToPage(Byte const* PageAddr, Byte *Buf, Word BufLen)
{
  ClrFlashSegment( PageAddr );
  Buf[BufLen] = 0xAA;
  BufLen++;
  WriteByteToFlash_MY(PageAddr, BufLen, Buf);
}
//=============================================================================
//  
//=======================================
void  TObject::WriteHexBufToPage(Byte const* PageAddr, Byte *HexBuf, Word BufLen)
{
  Byte buffer_send[256] = {0};
  //uint32_t temp = 0; 
    for (Word i = 0;i<BufLen/2;i++)
      buffer_send[i] = TBuffer::HexToByte(HexBuf+i*2);
    if((*(DWord*)&PageAddr % 1024) == 0)
      ClrFlashSegment( PageAddr );

    WriteByteToFlash_MY(PageAddr, BufLen/2, buffer_send);

