diroik/STM32WS/MKAB_BOOT_STM32F100/libs/src/Classes.cpp
}
//=============================================================================
//  
//=======================================
void  TObject::WriteLongHexBufToPage(Byte const* PageAddr, Byte *HexBuf, Word BufLen)
{
 Byte TmpMass[3] = {0,0,0};
 Byte TmpByte;
 //DWord TmpWord = (DWord)PageAddr;
 
  ClrFlashSegment( PageAddr );  

  for (Word i=0; i < (BufLen/2); i++)
  {
    TmpMass[0]  = HexBuf[i*2]; 
    TmpMass[1]  = HexBuf[i*2+1];
    TmpByte     = TBuffer::HexToWord(TmpMass);
    WriteByteToFlash(TmpByte,PageAddr++);
   CLEAR_WDT;      
   }

}
//=============================================================================
Word  TObject::ReturnFlashCRC(Byte const* PageAddr, Word BufLen)
{
Word CRC_SUM = 0;
   while(BufLen--)
   {
     CLEAR_WDT;      
     CRC_SUM += *PageAddr++;
   }
   return CRC_SUM;
}
//=============================================================================
Word  TObject::ReturnLongFlashCRC(Byte const* PageAddr, Word BufLen)
{
Word CRC_SUM = 0;
   while(BufLen--)
   {
     CLEAR_WDT;      
     CRC_SUM += *PageAddr++;
   }
   return CRC_SUM;
}





////=============================================================================
////  
////=======================================
FLASH_Status FLASH_GetBank1Status(void)
{
  FLASH_Status flashstatus = FLASH_COMPLETE;
  
  if((FLASH->SR & FLASH_FLAG_BANK1_BSY) == FLASH_FLAG_BSY) 
  {
    flashstatus = FLASH_BUSY;
  }
  else 
  {  
    if((FLASH->SR & FLASH_FLAG_BANK1_PGERR) != 0)
    { 
      flashstatus = FLASH_ERROR_PG;
    }
    else 
    {
      if((FLASH->SR & FLASH_FLAG_BANK1_WRPRTERR) != 0 )
      {
        flashstatus = FLASH_ERROR_WRP;
      }
      else
      {
        flashstatus = FLASH_COMPLETE;
      }
    }
  }
  /* Return the Flash Status */
  return flashstatus;
}

//=============================================================================


bool TObject::ClrFlashSegment(Byte const *SegAddr)
{  
Byte status = FLASH_COMPLETE;
FLASH->KEYR = FLASH_KEY1;
FLASH->KEYR = FLASH_KEY2;


FLASH->SR = FLASH_FLAG_EOP;
FLASH->SR = FLASH_FLAG_PGERR;
FLASH->SR = FLASH_FLAG_WRPRTERR;


while (FLASH->SR & FLASH_SR_BSY);
if (FLASH->SR & FLASH_SR_EOP) {
        FLASH->SR = FLASH_SR_EOP;
}

FLASH->CR |= FLASH_CR_PER;
FLASH->AR = *(uint32_t*)&SegAddr;
FLASH->CR |= FLASH_CR_STRT;
while (!(FLASH->SR & FLASH_SR_EOP));
FLASH->SR = FLASH_SR_EOP;
FLASH->CR &= ~FLASH_CR_PER;

FLASH->CR |= CR_LOCK_Set;
  /* Return the Erase Status */
return status;
}


//=============================================================================
//  
//=======================================
FLASH_Status FLASH_ProgramWord(uint32_t Address, uint32_t Data)
{
  FLASH_Status status = FLASH_COMPLETE;
  __IO uint32_t tmp = 0;


  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(ProgramTimeout);
  
  if(status == FLASH_COMPLETE)
  {
    /* if the previous operation is completed, proceed to program the new first 
    half word */
    FLASH->CR |= CR_PG_Set;
  
    *(__IO uint16_t*)Address = (uint16_t)Data;
    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation(ProgramTimeout);
 
    if(status == FLASH_COMPLETE)
    {
      /* if the previous operation is completed, proceed to program the new second 
      half word */
      tmp = Address + 2;

      *(__IO uint16_t*) tmp = Data >> 16;
    
      /* Wait for last operation to be completed */
      status = FLASH_WaitForLastOperation(ProgramTimeout);
        
      /* Disable the PG Bit */
      FLASH->CR &= CR_PG_Reset;
    }
    else
    {
      /* Disable the PG Bit */
      FLASH->CR &= CR_PG_Reset;
    }
  }         
   
  /* Return the Program Status */
  return status;
}


//--------------------------------------------------------------------------------------------------
// 
//--------------------------------------------------------------------------------------------------
FLASH_Status FLASH_WaitForLastOperation(uint32_t Timeout)
{ 
  FLASH_Status status = FLASH_COMPLETE;
   
  /* Check for the Flash Status */
  status = FLASH_GetBank1Status();
  /* Wait for a Flash operation to complete or a TIMEOUT to occur */
  while((status == FLASH_BUSY) && (Timeout != 0x00))
  {
    status = FLASH_GetBank1Status();
    Timeout--;
  }
  if(Timeout == 0x00 )
  {
    status = FLASH_TIMEOUT;
  }
  /* Return the operation status */
  return status;
}


//--------------------------------------------------------------------------------------------------
// 
//--------------------------------------------------------------------------------------------------
bool TObject::WriteByteToFlash_MY(Byte const * PageAddr, Word size_wr, Byte* ram_buf)
{
//static Byte buffer_for_write[4];
static Byte i;

FLASH->KEYR = FLASH_KEY1;													
FLASH->KEYR = FLASH_KEY2;

//FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR);	  // Clear All pending flags
FLASH->SR = FLASH_FLAG_EOP;
FLASH->SR = FLASH_FLAG_PGERR;
FLASH->SR = FLASH_FLAG_WRPRTERR;


for(i=0;i<size_wr/4;i++)
    {
    FLASH_ProgramWord(*(uint32_t *) &PageAddr,*(uint32_t *) &ram_buf[i*4]); // запись 4х байтового слова
    PageAddr = PageAddr +4;
    }

  FLASH->CR |= CR_LOCK_Set;
  return true;
}






//=============================================================================
//нельзя записывать меньше чем 4 байта
//=======================================
bool TObject::WriteByteToFlash(Byte data, Byte const *Addr)
{
  
  return 0;
}


//=============================================================================
//  
//=======================================
bool TObject::WriteWordToFlash( Word data, Word const*Addr )
{

  return 0;
}
//=============================================================================
//  
//=======================================
bool TObject::WriteBlockToFlash( Word* data, Word const*Addr )
{

  return 0;
}
//=============================================================================
//  
//=======================================
void  TObject::Soft_Reset(void)
{
  NVIC_SystemReset();
}
//=============================================================================
//  
//=======================================
Word Radr;



//--------------------------------------------------------------------------------------------------
// Передать управление приложению по заданному адресу
//--------------------------------------------------------------------------------------------------



