diroik/STM32WS/MKAB_BOOT_STM32F100/libs/src/Classes.cpp
void   TObject::DirectJump(DWord Addr)
{
//uint32_t JumpAddress = 0;
//
//if (((*(__IO uint32_t*)Addr) & 0x2FFE0000 ) == 0x20000000)           // Test if user code is programmed starting from address "ApplicationAddress"
//    { 
//    JumpAddress = *(__IO uint32_t*) (Addr + 4);   // исполнительный адрес пользовательского приложения
//    Jump_To_Application = (pFunction) JumpAddress;
//    __set_MSP(*(__IO uint32_t*) Addr);            // инициализируем указатель стека в пользовательском приложении
//     Jump_To_Application();                                     // передаем управление пользовательскому приложению
//    }

  
}
//*****************************************************************************
//*** Class TDispatcher
//*****************************************************************************
TDispatcher::TDispatcher()
{
  
}
//=============================================================================
//  
//=======================================
TDispatcher::~TDispatcher()
{
    PocessList.clear();
}
//=============================================================================
//  
//=======================================     
void TDispatcher::CreateProcess(PFV Process)
{
    PocessList.push_back(Process);
}  
//=============================================================================
//  
//=======================================
void TDispatcher::Scheduler()
{
  for(Byte i = 0; i < PocessList.size(); i++)
  { 
    PocessList[i](NULL); 
    CLEAR_WDT;
  }
  //__low_power_mode_3(); 
}
//*****************************************************************************
//*** Class TBuffer
//*****************************************************************************
//=============================================================================
// 
//=======================================
Word TBuffer::Crc(Byte const* pcBlock, Word len)
{
  Word crc = 0;

    while (len--)
    { 
      crc += *pcBlock++;
      CLEAR_WDT;      
    }
    return crc;  
}

//=============================================================================
// 
//=======================================
Word TBuffer::AppCrc(DWord StartAddr, Word BlockCNT)
{
  Word counter = PAGE_BLOCK_LEN;
  Word CRC_SUM = 0;
  DWord  CurrAddr = StartAddr;
  
  
  while(BlockCNT)
  {
    CLEAR_WDT;
    
//    if(CurrAddr >= MEM_FIRM_START)
//    {
      CRC_SUM += TBuffer::Crc((Byte const*)CurrAddr, counter);
      BlockCNT--; 
    //} 
//    else
//    { CLEAR_WDT;}
    CurrAddr += counter;
  }
  return CRC_SUM;  
}
//=============================================================================
// 
//=======================================
void TBuffer::XOR_Crypt(Byte* in, Word inlen, string pass)
{
  for ( Word x = 0; x < inlen; x++)
  {
      in[x] = (Byte)( in[x] ^ pass[x%pass.length()] );
      CLEAR_WDT;
  }
}
//=============================================================================
// 
//=======================================
DWord TBuffer::ByteToLong(Byte* Buf)
{
  Blong   LBuf;
    for (Word i = 0; i < 4 ; i++)
      LBuf.Data_b[i] = Buf[i];
    return LBuf.Data_l;
}
//=============================================================================
//
//=======================================
Word TBuffer::ByteToShort(Byte* Buf)
{
 Bshort  SBuf;

 for (Word i = 0; i < 2 ; i++)
	 SBuf.Data_b[i] = Buf[i];
 return SBuf.Data_s;
}
//=============================================================================
//
//=======================================
Word TBuffer::DeByteToShort(Byte* Buf)
{
 Bshort  SBuf;

 for (Word i = 0; i < 2 ; i++)
	 SBuf.Data_b[1-i] = Buf[i];
 return SBuf.Data_s;
}
//=============================================================================
//
//=======================================
void   TBuffer::ClrBUF(Byte *BUF, Word Len)
{
  for (Word i=0;i<Len;i++)
  {
    CLEAR_WDT;
    BUF[i] = 0;
  }
}
//=============================================================================
//
//=======================================
bool   TBuffer::StrCmp(Byte const* Str1, Byte const* Str2)
{
  while(*Str1)
  {
    CLEAR_WDT;
    if(*Str1++ != *Str2++)
    {  return false;}
  }
  if(*Str2 != 0)
  {  return false;}
  return true;
}
//=============================================================================
//
//=======================================
Word TBuffer::HexToWord(Byte *ptr)
{
    //Word number = 0;
  while(*ptr < 0x20) ptr++;
  
  Bshort number;
  number.Data_b[1] =  HexToByte(ptr); 
  ptr+=2;
  number.Data_b[0] =  HexToByte(ptr); 
  return number.Data_s;
}
//=============================================================================
//
//=======================================
DWord TBuffer::HexToDWord(Byte *Ptr)
{
  //while(*Ptr < 0x20) Ptr++;
  
  Blong number;
  number.Data_l = 0;
  number.Data_b[3] =  HexToByte(Ptr); 
  Ptr+=2;
  number.Data_b[2] =  HexToByte(Ptr); 
  Ptr+=2;
  number.Data_b[1] =  HexToByte(Ptr); 
  Ptr+=2;
  number.Data_b[0] =  HexToByte(Ptr); 
  
  
  return number.Data_l;
}

  
//=============================================================================
//
//=======================================
DWord TBuffer::HexToDWord_(Byte *ptr)
{
  //while(*Ptr < 0x20) Ptr++;
  
  //Blong number;
  //number.Data_l = 0;

Byte ch  = *ptr++;
Byte k   = 0;      
Byte result[7] = {0};
uint32_t out = 0;


    while(k < 7)
    { 
      CLEAR_WDT;
      if( (ch >= 'A') && (ch <= 'F') ) 
      {  result[k] = (ch - 'A') + 10; } 
      else if( (ch >= '0') && (ch <= '9') ) 
      {  result[k] = ch - '0';} 
      else
      {  return -1;}
      ch = *ptr++;   
      k++;
    }
  out = 0;
  out = out | result[0] << 24;
  out = out | result[1] << 20;
  out = out | result[2] << 16;
  out = out | result[3] << 12;
  out = out | result[4] << 8;
  out = out | result[5] << 4;
  out = out | result[6];
  
  
  return out;
}
//=============================================================================
//
//=======================================
sWord TBuffer::HexToByte(Byte *ptr)
{
   Byte ch  = *ptr++;
   Byte k   = 0;      
   Byte result[2] = {0,0};  

  while(k < 2)
  { 
    CLEAR_WDT;
    if( (ch >= 'A') && (ch <= 'F') ) 
    {  result[k] = (ch - 'A') + 10; } 
    else if( (ch >= '0') && (ch <= '9') ) 
    {  result[k] = ch - '0';} 
    else
    {  return -1;}
    ch = *ptr++;   
    k++;
  }
  return (result[0] <<= 4) + result[1];
}
//=============================================================================
//
//=======================================
void TBuffer::ByteToHex(Byte *HEX, Byte BYTE)
{
 Byte ch = (BYTE >> 4) & 0x0F;
 Byte k  = 0;
  
   while(k < 2)
   {
     CLEAR_WDT;
     if(ch > 9)
     {  *HEX++ = ch + 'A' - 10;}  
     else 
     {  *HEX++ = ch + '0';}
  
     ch = BYTE & 0x0F;
     k++;
   }
   HEX = NULL;
}
//=============================================================================
//
//=======================================
void TBuffer::WordToHex(Byte *HEX, Word WORD)
{
  ByteToHex(HEX, (Byte)( WORD >> 8) );
  ByteToHex(&HEX[2], (Byte)( WORD) );
}
//=============================================================================
//
//=======================================
string TBuffer::WordToHex(Word WORD)
{
  Byte HEX[5] = {0x30,0x30,0x30,0x30,0};
   
  ByteToHex(HEX, (Byte)( WORD >> 8) );
  ByteToHex(&HEX[2], (Byte)( WORD) );
  
