diroik/STM32WS/MKAB_BOOT_STM32F100/libs/src/Classes.cpp
  return string((char*)HEX);
}
//=============================================================================
//
//=======================================
string TBuffer::DWordToHex(DWord Value)
{
  Byte HEX[9] = {0x30,0x30,0x30,0x30,0x30,0x30,0x30,0x30,0};
   
  ByteToHex(HEX, (Byte)( Value >> 24) );
  ByteToHex(&HEX[2], (Byte)( Value >> 16) );
  
   ByteToHex(&HEX[4], (Byte)( Value >> 8) );
  ByteToHex(&HEX[6], (Byte)( Value) ); 
  
  return string((char*)HEX);
}
//=============================================================================
//
//=======================================
void TBuffer::DWordToHex(Byte *HEX, DWord DWORD)
{
  WordToHex(HEX, (Word)( DWORD >> 16) );
  WordToHex(&HEX[4], (Word)( DWORD) );
}
//=============================================================================
//
//=======================================
Word TBuffer::CopyString(Byte* DestStr, Byte* SrcStr)
{
  Word len = 0;
  
  while(*SrcStr)
  {
    *DestStr++ = *SrcStr++;
    len++;
    CLEAR_WDT;    
  }

  *DestStr = 0;
  return len;
}       
//=============================================================================
//
//=======================================
Byte TBuffer::FloatToString(Byte *ReturnBUF, float Val, Byte AllSymb, Byte AfteComma)
{
  sprintf((char*)ReturnBUF,"%0*.*f",AllSymb,AfteComma,Val);
  return AllSymb;
}
//=============================================================================
//
//=======================================
string TBuffer::FloatToString(float Val, Byte AllSymb, Byte AfteComma)
{
  char buff[64];
  if(AllSymb == 0)
  { sprintf(buff,"%.*f",AfteComma,Val);}
  else
  { sprintf(buff,"%0*.*f",AllSymb,AfteComma,Val);}
  string MyString(buff);
  return MyString;
}
//=============================================================================
//
//=======================================
Byte TBuffer::IntToString(Byte *ReturnBUF, int Val, Byte AllSymb)
{
  sprintf((char*)ReturnBUF,"%0*i",AllSymb,Val);
  return AllSymb;
}
//=============================================================================
//
//=======================================
string TBuffer::IntToString(int Val,Byte AllSymb)
{
char buff[64];
  if(AllSymb == 0)
  { sprintf(buff,"%i",Val);}
  else
  { sprintf(buff,"%0*i",AllSymb,Val);}
  string MyString(buff);
return MyString;
}
//=============================================================================
//
//=======================================
string TBuffer::WordToString(Word Val, Byte AllSymb)
{
  char buff[6] = {0x30,0x30,0x30,0x30,0x30,0};
  sByte index = 4;
  Word counter = 1;
  Word tmpcounter = 1;
  Word tmp1;
  Word tmp2;
  
  do
  {
    counter*=10;
    tmp1 = Val/counter;
    tmp2 = Val%counter;
    tmp2 = tmp2/tmpcounter;
    tmpcounter = counter;
    buff[index--] = tmp2+0x30;
  }
  while(tmp1 > 0 && index > 0);
  if(tmp1 > 0)
  { buff[index--] = tmp1+0x30;}
  if(AllSymb > 0)
  {
    sByte i = index+1;
    if(i > 0)
    {
      if(AllSymb > 5) 
      { AllSymb = 5;}
      Byte siz = 5-i;
      i=AllSymb-siz;
      if(i>0)
      {
        index-=i;
      }
    }
  }
  return string(&buff[index+1]);
}
//=============================================================================
//
//=======================================
string TBuffer::LongToString(long Val,Byte AllSymb)
{
char buff[64];
  if(AllSymb == 0)
  { sprintf(buff,"%li",Val);}
  else
  { sprintf(buff,"%0*li",AllSymb,Val);}
  string MyString(buff);
return MyString;
}
//=============================================================================
//
//=======================================
void  TBuffer::Split(string &str, string separator, vector<string> &results, int Len)
{
    int found;
    found = str.find(separator);
    while(found != string::npos)
    {
      CLEAR_WDT;
        if(found > 0)
        { 
          results.push_back(str.substr(0,found));
          if(Len > 0 && results.size()>= Len)
          { return;}
        }
        str = str.substr(found+separator.size());
        found = str.find(separator);
    }
    if(str.length() > 0)
    { results.push_back(str);}
}
//=============================================================================
//
//=======================================
int  TBuffer::find_first_of(TBuffer *BUFFER, Byte simb)
{
  int returnVal = -1;
  for(int i=0; i < BUFFER->DataLen; i++)
  {
    CLEAR_WDT;
    if(BUFFER->BUF[i] == simb)
    {
      returnVal = i;
      break;
    }
  }
return returnVal;
}
//=============================================================================
//
//=======================================
int  TBuffer::find_first_of(Byte *BUFFER, Word Len, Byte simb)
{
  int returnVal = -1;
  for(int i=0; i < Len; i++)
  {
    CLEAR_WDT;
    if(BUFFER[i] == simb)
    {
      returnVal = i;
      break;
    }
  }
return returnVal;
}
//=============================================================================
//
//=======================================
int  TBuffer::find_last_of(TBuffer *BUFFER, Byte simb)
{
  int returnVal = -1;
  for(int i=(BUFFER->DataLen-1); i > 0; i--)
  {
    CLEAR_WDT;
    if(BUFFER->BUF[i] == simb)
    {
      returnVal = i;
      break;
    }
  }
return returnVal;
}

//=============================================================================
//
//=======================================
Word TBuffer::clear_all_nulls(char *_ptr, Word _size)
{
        //HOLD_WDT;
        char *ptrDst;
        char *ptrSrc;
        for(int i = 0; i <= _size; i++)
        {
          CLEAR_WDT;
          ptrDst = &_ptr[i];
          if( *ptrDst < ' ')
          {
            ptrSrc = &_ptr[i+1]; 
            int rsz = (_size-i);
            for(int j = 0; j < rsz; j++)
            {
              CLEAR_WDT;
              ptrDst[j] = ptrSrc[j];
            }
            if(rsz > 0)
            {
              _size--;
              i--;
            }
          }
        }
        _ptr[_size] = 0;
        return _size;
}

//*****************************************************************************
//***TDateTime
//*****************************************************************************
//=============================================================================
// 
//=======================================
TDateTime::TDateTime() 
{
    TRtcTime time;
      time.Year  = 2010; 	
      time.Month = 1;
      time.Day   = 1;
      time.Hour  = 0;
      time.Minute= 0;
      time.Second= 1;
      GlobalSeconds = 1;
    SetTime(time);
}  
//=============================================================================
// 
//=======================================
TDateTime::TDateTime(TRtcTime time)
{ 
    SetTime(time);
}
//=============================================================================
// 
//=======================================
TDateTime::~TDateTime()
{}
//=============================================================================
// 
//=======================================  
TRtcTime TDateTime::GetTime(void)
{
      return DateTime;
}
//=============================================================================
// 
//=======================================    
void TDateTime::SetTime(TRtcTime dateTime)
{
      DateTime      = dateTime;
      GlobalSeconds = DateTime.Hour*3600L+DateTime.Minute*60L+DateTime.Second;
}
//=============================================================================
// 
//=======================================    
void TDateTime::IncSecond(void)
{
    if(++DateTime.Second >= 60)
    {
      DateTime.Second = 0;
      IncMinute();
    }
    if(GlobalSeconds++ > 86400L)//ограничили макс-значение
    { GlobalSeconds = DateTime.Hour*3600L+DateTime.Minute*60L+DateTime.Second;}
}
//=============================================================================
// 
//=======================================    
DWord TDateTime::GetGlobalSeconds(void)
{ 
  return GlobalSeconds;
}
//=============================================================================
// 
//=======================================     
void TDateTime::IncMinute(void)
{
    if(++DateTime.Minute >= 60)
    {
      DateTime.Minute = 0;
      IncHour();
    }
}
//=============================================================================
// 
//=======================================   
void TDateTime::IncHour(void)
{
    if(++DateTime.Hour >= 24)
    {
      DateTime.Hour = 0;
      IncDay();
    }
}
//=============================================================================
// 
//=======================================    
void TDateTime::IncDay(void)
{
   Byte DaysInMonth = 31;
    if(DateTime.Month == 4 || DateTime.Month == 6 || DateTime.Month == 9 || DateTime.Month == 11 )
    { DaysInMonth = 30;}
    else if( DateTime.Month == 2)
    {
      if(IsLeapYear( DateTime.Year ) == true)
      { DaysInMonth = 29;}
      else
      { DaysInMonth = 28;}
    }    
    if(++DateTime.Day > DaysInMonth)
    {
      DateTime.Day = 1;
      IncMonth();
    }
}
//=============================================================================
// 
//=======================================  
void TDateTime::IncMonth(void)
{
    if(++DateTime.Month > 12)
    {
      DateTime.Month = 1;
      DateTime.Year++;
    }
}  
//=============================================================================
// 
//=======================================  
bool TDateTime::IsLeapYear(Word Year) 
{
    // Проверка високосного года
    if( (Year%4 == 0) && ((Year % 100 != 0) || (Year % 400 == 0)) )
    {  return true;} // високосный
    else
    {  return false;} //не високосный
}
//*****************************************************************************
//*****************************************************************************
//*** Class TComPort
//*****************************************************************************
TComPort::TComPort():enabled(false),TTimer(4),commPortHandle(INVALID_HANDLE_VALUE),ByteIndex(0),time_outs(),CRC_SUM(0),StxFlag(false),DataReceiving(false)
{
  DATA_Rx = NULL;
}
//=============================================================================
// Destructor
//=======================================
TComPort::~TComPort()
{
	if (commPortHandle != INVALID_HANDLE_VALUE)
	{	CloseHandle(commPortHandle);}
}
//=============================================================================
//
//=======================================
void TComPort::PushByteToDATA_Rx(Byte Data)
{
  if(DATA_Rx!=NULL)
  {
    DATA_Rx->push(Data);
  }
}
//=============================================================================
//
//=======================================
sWord TComPort::PopByteDATA_Rx(void)
{
  if(DATA_Rx!=NULL)
  { return DATA_Rx->pop();}
  else
  { return -1;}
}
//=============================================================================
// Closes the com port 
//=======================================
bool TComPort::close()
{
	if (commPortHandle != INVALID_HANDLE_VALUE)
	{	CloseHandle(commPortHandle);}
	commPortHandle = INVALID_HANDLE_VALUE;
	return true;
}
//=============================================================================
// Closes the com port Handle
//=======================================
bool TComPort::CloseHandle(HANDLE commPort)
{
  __disable_interrupt(); 
      switch (commPort)
      {
          case COM0:
              //close_UART0();
              break;
          
