diroik/STM32WS/MKAB_BOOT_STM32F100/libs/src/Classes.cpp
          case COM1:
         //     close_UART1();
              break;
          
          default:
              return false;
      } 
  enabled = false;   
  
 __enable_interrupt();

  return true;
}
//=============================================================================
//=======================================
void TComPort::ClrByteIndex(void)
{
  ByteIndex = 0;
}
//=============================================================================
//=======================================
void TComPort::SetTimeOuts(COMMTIMEOUTS timeouts)
{
  time_outs = timeouts;
}
//=============================================================================
//=======================================        
void TComPort::GetTimeOuts(COMMTIMEOUTS &timeouts)
{
  timeouts = time_outs; 
}
//=============================================================================
// open com port 
//=======================================
//=============================================================================
// open com port 
//=======================================
HANDLE TComPort::open(Port port, DWord baudRate, DWord ReadIntervalTimeout)
{
  COMMTIMEOUTS timeouts;
  bool flag     = true;
  __disable_interrupt(); 
      switch (port)
      {
        case COM0:
          


          GPIOA->CRH = GPIO_CRH_CNF9_1;
          GPIOA->CRH |= GPIO_CRH_MODE9;
          GPIOA->CRH |= GPIO_CRH_CNF10_0;

          RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
          USART1->CR1 = ( USART_CR1_RE | USART_CR1_TE);

          //Разрешение прерываний
          //USART1->CR1 |= USART_CR1_TXEIE;
          USART1->CR1 |= USART_CR1_RXNEIE;
          //USART1->CR1 |= USART_CR1_TCIE;

          // 38400 Делитель = 16000000/(16*38400) = 26.0416
          USART1->BRR =(13<<4); 	// Целая часть 26
          //USART2->BRR |= 13; 	    // Дробная часть коэффициента деления USART 0.041 * 16 = 0.6
          USART1->CR1 |= USART_CR1_UE;	

          RX_BUF = (Byte*)&USART1->DR;
          TX_BUF = (Byte*)&USART1->DR;
          
          NVIC_EnableIRQ(USART1_IRQn);     //Включение вектора прерывания
          
        break;
        default:
            if(flag)
            {__enable_interrupt();}
              return INVALID_HANDLE_VALUE;
      }    
      this->InitPort(baudRate);   
      enabled                         = true;    
      commPortHandle                  = (HANDLE)port;
      timeouts.ReadIntervalTimeout    = ReadIntervalTimeout;
      timeouts.ReadTotalTimeout       = timeouts.ReadIntervalTimeout*timeouts.ReadTotalTimeoutMultiplier;
      SetTimeOuts(timeouts); 
      if(flag)
      {
        __enable_interrupt();
      }
  return commPortHandle; 
}
//=============================================================================
// читаем байт
//=======================================
bool TComPort::RecvByte(Byte *data)
{
  if ( this->DATA_Rx == NULL || this->DATA_Rx->empty() )
  {  return false;}
  else
  {
    *data = this->DATA_Rx->pop();
    this->SetTimer(RX_BYTE_TIMEOUT, time_outs.ReadIntervalTimeout);//брос межбайтового таймаута
    return true;
  }   
}
//=============================================================================
// пишем байт
//=======================================
bool TComPort::SendByte(Byte data)
{    
       
       if ( GetTxIntFlag() )
       {
          this->SetTxIntEnable(true);
          //TTimer::wait_1ms(10);
          //this->DATA_Tx = data;
          USART1->DR = data;
          
          
          return true;  
       }     
       else 
       {  
         return false; 
       }   
}
//=============================================================================
//
//=======================================
sWord   TComPort::Send(Byte *Buf, Word Len)
{
  if (Len == 0)
  {  return 1;} 
  
   TX_Ready();
   if ( SendByte(Buf[ByteIndex]) )
   {  
     while( UsartIsBusy() ){  CLEAR_WDT;}    
     TTimer::wait_1us( (SMCLK / BaudRate)/15);
     if ( ++ByteIndex >= Len )
     {     
       DataReceiving = false;
       ByteIndex = 0;
       RX_Ready();
       return Len;
     }    
   }   
  return 0;
}
//=============================================================================
//
//=======================================
sWord   TComPort::Send(Byte *Buf, Word Len, bool separate)
{
  if (Len == 0)
  {  return 1;} 
  
  if(separate == true)
  { ClearRxBUF();}
  
  TX_Ready();
  do
  {
    CLEAR_WDT;
     if( !SendByte(Buf[ByteIndex]) )
     {  break; }    
     while( UsartIsBusy() ){  CLEAR_WDT;}
     if ( ++ByteIndex >= Len )
     {     
       DataReceiving  = false;
       sWord tmp      = ByteIndex;
       ByteIndex      = 0;
       return tmp;
     }
  }
  while(separate);
  return 0;
}

//=============================================================================
// Читаем (выход по таймауту)
//=======================================
sWord TComPort::Recv(Byte *Buf, Word Len, Word MaxLen)
{
  Byte data;  
      if(Len == 0){ return 0;}
      if(Len > MaxLen) { Len = MaxLen;}
      if(DataReceiving == false)
      {
         DataReceiving = true;
         SetTimer(RX_BYTE_TIMEOUT,time_outs.ReadIntervalTimeout);
         ByteIndex = 0;
      }
      RX_Ready();
      while( RecvByte(&data) )
      {   
        CLEAR_WDT;
        Buf[ByteIndex++] = data;
        if( ByteIndex >= Len )
        {
             Word TmpWord = ByteIndex;
             ByteIndex       = 0x00;
             DataReceiving = false;
             return TmpWord;
        }          
      };
      if(DataReceiving == true)
      { 
         if ( GetTimValue(RX_BYTE_TIMEOUT) <= 0) //проверка на таймаут
         {    
             Word TmpWord = ByteIndex;
             ByteIndex       = 0x00;
             DataReceiving = false;
             return TmpWord;
         }  
      }
      return -1;    
}
//=============================================================================
// Читаем
//=======================================
sWord TComPort::RecvTo(Byte *Buf, Word MaxLen, Byte StopSymbol)
{
      Byte data;
      if(DataReceiving == false)
      {
         DataReceiving = true;
         SetTimer(RX_BYTE_TIMEOUT,time_outs.ReadIntervalTimeout);
         ByteIndex = 0;
      }
      RX_Ready();
      while( RecvByte(&data) )
      {
        CLEAR_WDT;
        Buf[ByteIndex++] = data;
        if(ByteIndex >=MaxLen)
        { ByteIndex = MaxLen-1;}
        if(data == StopSymbol)
        {
             Word TmpWord = ByteIndex;
             ByteIndex       = 0x00;
             DataReceiving = false;
             return TmpWord;
        }          
      };
      if(DataReceiving == true)
      { 
           if ( GetTimValue(RX_BYTE_TIMEOUT) <= 0) //проверка на таймаут
           {    
             Word TmpWord = ByteIndex;
             ByteIndex       = 0x00;
             DataReceiving = false;
             return TmpWord;
           }  
      }
      return -1;    
}
//=======================================
void TComPort::ClearRxBUF()
{
  if(DATA_Rx!=NULL)
  {DATA_Rx->clear();}
}
//=======================================
bool TComPort::Busy()
{
  return (bool)ByteIndex;
}
//=============================================================================
// 
//=======================================
void TComPort::InitPort(DWord BAUDRATE)
{

