diroik/STM32WS/MKAB_BOOT_STM32F100/libs/src/Classes.cpp
}
//=============================================================================
// 
//=======================================
bool TComPort::GetTxIntFlag(void)
{
  uint16_t status = USART1->SR;
  return (bool)(status & USART_SR_TC);
}
//=============================================================================
// 
//=======================================
void TComPort::SetTxIntFlag(bool state)
{

}
//=============================================================================
// 
//=======================================
bool TComPort::UsartIsBusy(void)
{
  uint16_t status;
  uint16_t out;
  status = USART1->SR;
  out = (~status & USART_SR_TC);
  //out = ~out;
  return (bool) out;
}

//=============================================================================
// 
//=======================================
void TComPort::SetTxIntEnable(bool state)
{
   if(state == true)
   {  
     USART1->CR1  |=  USART_CR1_TXEIE;
     //USART1->CR1  &= ~USART_CR1_RXNEIE;
   }
   else
   {  
     USART1->CR1  &= ~USART_CR1_TXEIE;
     //USART1->CR1  |=  USART_CR1_RXNEIE;
   }
}
//=============================================================================
// 
//=======================================
void TComPort::SetRxIntEnable(bool state)
{
   if(state == true)
   {  USART1->CR1  |=  USART_CR1_RXNEIE;}
   else
   {  USART1->CR1  &= ~USART_CR1_RXNEIE;}
}
//=============================================================================
// 
//=======================================
Byte TComPort::GetRxDataByte()
{
  return *RX_BUF;
}
//=============================================================================
// 
//=======================================       
void TComPort::SetTxDataByte(Byte data)
{
  *TX_BUF = data;
}
//=============================================================================
//
//=======================================
bool    TComPort::TestStxFlag(void)
{
   return StxFlag;
}
//=============================================================================
// подготовка к приему данных
//=======================================
void    TComPort::ClrStxFlag(void)
{
   StxFlag   = false;
   ByteIndex = 0;
   RX_Disable();
}
//*****************************************************************************
//*** TTimer
//*****************************************************************************
//=============================================================================
// Constructor
//=======================================
TTimer::TTimer(Byte Timers):TimerCNT(Timers)
{
  //HOLD_WDT;
    Timer = new DWord[TimerCNT];
    for(Word i = 0; i < TimerCNT; i++)
    { 
      CLEAR_WDT;
      SetTimer(i,0);
    }
  CLEAR_WDT;
} 
//=============================================================================
// Destructor
//======================================= 
TTimer::~TTimer()
{
    delete[] Timer;
}
//=============================================================================
// 
//=======================================  
bool TTimer::SetTimer(Byte TimNam, DWord Value)
{
__disable_interrupt(); 
bool state;
  if (TimNam<TimerCNT)
  {
    Timer[TimNam] = Value;
    state = true;
  }
  else
  {
    state = false;
  }
  
__enable_interrupt(); 
return state;
}
//=============================================================================
// 
//=======================================  
void TTimer::DecTimer(Byte TimNam)
{
  if (TimNam >= TimerCNT)//debug
  {  return;}
  if (Timer[TimNam] > 0)
  {  Timer[TimNam]--;}
}
//=============================================================================
// 
//=======================================
sDWord TTimer::GetTimValue(Byte TimNam)
{
  __disable_interrupt(); 
  sDWord Val;
  if (TimNam>=TimerCNT)
      Val = -1;
  else
    Val = Timer[TimNam];
  
  __enable_interrupt(); 
  return Val;
}
//=============================================================================
// 
//=======================================
void TTimer::wait_1ms(Word cnt)
{
    Word i;

        CLEAR_WDT;
	for (i = 0; i < cnt; i++)
        { 
//          __delay_cycles(14745);
        }
        CLEAR_WDT;
}
//=============================================================================
// 
//=======================================
void TTimer::wait_1us(Word cnt)
{
	for (Word i = 0; i < cnt; i++)
        { 
//          __delay_cycles(14);
        }
}

//*****************************************************************************
//*****************************************************************************